Repository: brook5407/42KL-ft_transcendence
Catalog: django/src/locale/*/LC_MESSAGES/django.po
Languages: ms

source: Invalid language
ms: Salah Bahasa

source: Invalid intensity value
ms: Nilai keamatan tidak sah

source: English
ms: Bahasa Inggeris

source: Malay
ms: Bahasa Malaysia

source: Chinese
ms: Bahasa Cina

source: Verification key is missing
ms: Tiada Kunci pengesahan

source: Your email has been successfully verified.
ms: E-mel anda telah berjaya disahkan.

source: There was an error verifying your email.
ms: Berlaku ralat mengesahkan e-mel anda.

source: OTP sent. Please check your email.
ms: OTP telah dihantar. Sila semak e-mel anda.

source: User email is not verified.
ms: E-mel pengguna tidak disahkan.

source: User does not exist.
ms: E-mel pengguna belum disahkan.

source: OTP is invalid
ms: OTP tidak sah

source: OTP has expired, Please request a new one
ms: OTP telah tamat tempoh, Sila minta yang baharu

source: friend_id is required
ms: Sila letak friend_id

source: friend blocked
ms: rakan dihalang

source: friend unblocked
ms: rakan telah dinyahsekat

source: friend deleted
ms: rakan dipadamkan

source: username query parameter is required
ms: parameter pertanyaan nama pengguna diperlukan

source: cannot add yourself as a friend
ms: tidak boleh menambah diri anda sebagai kawan

source: already friends
ms: sudah kawan

source: not authorized
ms: tidak dibenarkan

source: friend request accepted
ms: permintaan rakan diterima

source: friend request rejected
ms: permintaan rakan ditolak

source: friend request already sent
ms: permintaan rakan sudah dihantar

source: friend request sent
ms: permintaan rakan dihantar

source: Chat List
ms: Senarai Sembang

source: Loading...
ms: Memuatkan...

source: Type a message or type /invite
ms: masuk mesej atau masuk /invite

source: Friends
ms: Kawan-kawan

source: Profile
ms: Profil

source: This user didn't say anything
ms: Pengguna ini tidak berkata apa-apa

source: See Match History
ms: Lihat Sejarah Perlawanan

source: Unblock
ms: Nyahsekat

source: Block
ms: blok

source: Delete
ms: Padam

source: Add Friend
ms: Tambah Rakan

source: Friend deleted successfully
ms: Rakan berjaya dipadamkan

source: Friend blocked successfully
ms: rakan berjaya dihalang

source: Friend unblocked successfully
ms: Rakan berjaya dinyahsekat

source: Failed to unblock friend
ms: Gagal menyahsekat rakan

source: Friend request sent successfully
ms: Permintaan rakan telah berjaya dihantar

source: Wins
ms: Menang:

source: Losses
ms: Kalah:

source: Friend Requests
ms: Permintaan Rakan

source: New Friends
ms: Kawan Baru

source: Search new friends...
ms: Cari kawan baru...

source: No Results Found
ms: Tiada Hasil Ditemui

source: Friend Request Sent
ms: Permintaan Rakan Dihantar

source: Already friend
ms: Sudah kawan

source: Requested
ms: Diminta

source: Match History
ms: Sejarah Perlawanan

source: Create Tournament
ms: Lobi Pertandingan

source: Name
ms: Nama

source: Description
ms: Penerangan

source: Submit
ms: Hantar

source: Tournament created successfully
ms: Rakan berjaya dipadamkan

source: Tournaments
ms: Pertandingan:

source: Shuffle Rooms
ms: Shuffle Bilik

source: Start
ms: Mulakan

source: Leave
ms: Tinggalkan

source: Edit Profile
ms: Edit Profil

source: Nickname
ms: Nama panggilan

source: Save
ms: Simpan

source: Please select a valid image file.
ms: Sila pilih fail imej yang sah.

source: The selected file is too large. Please select a file smaller than 1 MB.
ms: Sila pilih fail yang lebih kecil daripada 1 MB

source: Settings
ms: Tetapan

source: Language
ms: Bahasa

source: Password
ms: Kata laluan

source: Change Password
ms: Tukar Kata Laluan

source: Snow Fall Intensity
ms: Intensiti Musim Salji

source: Want username and password sign in? Click
ms: Ingin log masuk nama pengguna dan kata laluan? klik

source: here
ms: sini

source: 42 Login
ms: 42 Log Masuk

source: Old Password
ms: Kata laluan

source: New Password
ms: Kata Laluan Baru

source: Confirm New Password
ms: Pengesahan Kata Laluan Baharu

source: Forget Password
ms: Lupa Kata Laluan

source: Email
ms: Alamat e-mel

source: Reset Password
ms: Tetapkan Semula Kata Laluan

source: Confirm Password
ms: Pengesahan Kata Laluan

source: Sign In
ms: Log Masuk

source: New user? Register
ms: Pengguna baru? Daftar

source: Username
ms: Nama pengguna

source: send
ms: hantar

source: Forgot Password?
ms: Lupa Kata Laluan?

source: OTP sent to your email!
ms: OTP telah dihantar ke e-mel anda!

source: Resend OTP in
ms: Hantar semula OTP masuk

source: Resend OTP
ms: Hantar semula OTP

source: Sign Up
ms: Daftar

source: Already gave an account? Login
ms: Sudah daftar? Log Masuk

source: Searching for opponent...
ms: Mencari lawan...

source: [Winner]
ms: [Pemenang]

source: Room Code
ms: Kod Bilik

source: Current
ms: Semasa

source: Next
ms: Seterusnya
